In [1]:
import pandas as pd
import numpy as np
d1=pd.DataFrame({"col1":[1,2,3,4],"col2":[5,6,7,8]})
d2=pd.DataFrame({"col1":[11,12,13,14],"col2":[15,16,17,18]})

In [2]:
df10 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df11 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
display(df10,df11)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

In [5]:
display(pd.merge(df10,df11,how='outer'))

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [6]:
ans=pd.merge(df10,df10,how='left')
ans

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread